RT-Thread/rt-thread/bsp/microchip/saml10/bsp/include/saml10d14a.h
  PERIPH_COUNT_IRQn        = 45  /**< Number of peripheral IDs */
} IRQn_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset  */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted  */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault     */
  void* pvReservedC12;
  void* pvReservedC11;
  void* pvReservedC10;
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction  */
  void* pvReservedC4;
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service  */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer                    */


  /* Peripheral handlers */
  void* pfnSYSTEM_Handler;                       /* 0   SAML10D14A Main Clock (MCLK)   */
  void* pfnWDT_Handler;                          /* 1   SAML10D14A Watchdog Timer (WDT) */
  void* pfnRTC_Handler;                          /* 2   SAML10D14A Real-Time Counter (RTC) */
  void* pfnEIC_0_Handler;                        /* 3   SAML10D14A External Interrupt Controller (EIC) */
  void* pfnEIC_1_Handler;                        /* 4   SAML10D14A External Interrupt Controller (EIC) */
  void* pfnEIC_2_Handler;                        /* 5   SAML10D14A External Interrupt Controller (EIC) */
  void* pfnEIC_3_Handler;                        /* 6   SAML10D14A External Interrupt Controller (EIC) */
  void* pfnEIC_OTHER_Handler;                    /* 7   SAML10D14A External Interrupt Controller (EIC) */
  void* pfnFREQM_Handler;                        /* 8   SAML10D14A Frequency Meter (FREQM) */
  void* pfnNVMCTRL_Handler;                      /* 9   SAML10D14A Non-Volatile Memory Controller (NVMCTRL) */
  void* pfnPORT_Handler;                         /* 10  SAML10D14A Port Module (PORT)  */
  void* pfnDMAC_0_Handler;                       /* 11  SAML10D14A Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_1_Handler;                       /* 12  SAML10D14A Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_2_Handler;                       /* 13  SAML10D14A Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_3_Handler;                       /* 14  SAML10D14A Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_OTHER_Handler;                   /* 15  SAML10D14A Direct Memory Access Controller (DMAC) */
  void* pfnEVSYS_0_Handler;                      /* 16  SAML10D14A Event System Interface (EVSYS) */
  void* pfnEVSYS_1_Handler;                      /* 17  SAML10D14A Event System Interface (EVSYS) */
  void* pfnEVSYS_2_Handler;                      /* 18  SAML10D14A Event System Interface (EVSYS) */
  void* pfnEVSYS_3_Handler;                      /* 19  SAML10D14A Event System Interface (EVSYS) */
  void* pfnEVSYS_NSCHK_Handler;                  /* 20  SAML10D14A Event System Interface (EVSYS) */
  void* pfnPAC_Handler;                          /* 21  SAML10D14A Peripheral Access Controller (PAC) */
  void* pfnSERCOM0_0_Handler;                    /* 22  SAML10D14A Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_1_Handler;                    /* 23  SAML10D14A Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_2_Handler;                    /* 24  SAML10D14A Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_OTHER_Handler;                /* 25  SAML10D14A Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_0_Handler;                    /* 26  SAML10D14A Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_1_Handler;                    /* 27  SAML10D14A Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_2_Handler;                    /* 28  SAML10D14A Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_OTHER_Handler;                /* 29  SAML10D14A Serial Communication Interface (SERCOM1) */
  void* pvReserved30;
  void* pvReserved31;
  void* pvReserved32;
  void* pvReserved33;
  void* pfnTC0_Handler;                          /* 34  SAML10D14A Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /* 35  SAML10D14A Basic Timer Counter (TC1) */
  void* pfnTC2_Handler;                          /* 36  SAML10D14A Basic Timer Counter (TC2) */
  void* pfnADC_OTHER_Handler;                    /* 37  SAML10D14A Analog Digital Converter (ADC) */
  void* pfnADC_RESRDY_Handler;                   /* 38  SAML10D14A Analog Digital Converter (ADC) */
  void* pfnAC_Handler;                           /* 39  SAML10D14A Analog Comparators (AC) */
  void* pfnDAC_UNDERRUN_A_Handler;               /* 40  SAML10D14A Digital Analog Converter (DAC) */
  void* pfnDAC_EMPTY_Handler;                    /* 41  SAML10D14A Digital Analog Converter (DAC) */
  void* pfnPTC_Handler;                          /* 42  SAML10D14A Peripheral Touch Controller (PTC) */
  void* pfnTRNG_Handler;                         /* 43  SAML10D14A True Random Generator (TRNG) */
  void* pfnTRAM_Handler;                         /* 44  SAML10D14A TrustRAM (TRAM)     */
} DeviceVectors;

/* Defines for Deprecated Interrupt and Exceptions handler names */
#define pfnMemManage_Handler      pfnMemoryManagement_Handler     /**< \deprecated  Backward compatibility for ASF */
#define pfnDebugMon_Handler       pfnDebugMonitor_Handler         /**< \deprecated  Backward compatibility for ASF */
#define pfnNMI_Handler            pfnNonMaskableInt_Handler       /**< \deprecated  Backward compatibility for ASF */
#define pfnSVC_Handler            pfnSVCall_Handler               /**< \deprecated  Backward compatibility for ASF */

